Adam learning_rate:<tensorflow.python.keras.optimizer_v2.adam.Adam object at 0x000002346F4B8BC8> 
Model: "config8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_7 (LSTM)                (None, 8)                 448       
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 18        
=================================================================
Total params: 466
Trainable params: 466
Non-trainable params: 0
_________________________________________________________________
