Adam learning_rate:<tensorflow.python.keras.optimizer_v2.adam.Adam object at 0x000002348AB416C8> 
Model: "config3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 2)                 64        
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 6         
=================================================================
Total params: 76
Trainable params: 76
Non-trainable params: 0
_________________________________________________________________
