Adam learning_rate:<tensorflow.python.keras.optimizer_v2.adam.Adam object at 0x000002348AA35308> 
Model: "config5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_4 (LSTM)                (None, 6)                 288       
_________________________________________________________________
dense_9 (Dense)              (None, 3)                 21        
_________________________________________________________________
dense_10 (Dense)             (None, 8)                 32        
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 18        
=================================================================
Total params: 359
Trainable params: 359
Non-trainable params: 0
_________________________________________________________________
