Adam learning_rate:<tensorflow.python.keras.optimizer_v2.adam.Adam object at 0x0000023499B50748> 
Model: "config4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_3 (LSTM)                (None, 1)                 28        
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 2         
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 4         
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 6         
=================================================================
Total params: 40
Trainable params: 40
Non-trainable params: 0
_________________________________________________________________
