Adam learning_rate:<tensorflow.python.keras.optimizer_v2.adam.Adam object at 0x000002348ABD1D08> 
Model: "config6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_5 (LSTM)                (None, 1)                 28        
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 4         
_________________________________________________________________
dense_13 (Dense)             (None, 2)                 6         
=================================================================
Total params: 38
Trainable params: 38
Non-trainable params: 0
_________________________________________________________________
