Adam learning_rate:<tensorflow.python.keras.optimizer_v2.adam.Adam object at 0x000002349977FF48> 
Model: "config7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_6 (LSTM)                (None, 1)                 28        
_________________________________________________________________
dense_14 (Dense)             (None, 2)                 4         
_________________________________________________________________
dense_15 (Dense)             (None, 2)                 6         
=================================================================
Total params: 38
Trainable params: 38
Non-trainable params: 0
_________________________________________________________________
